{
  "backend/main.mo": "Actor implementing article CRUD, publish workflow, admin auth, and blob storage integrations using maps and authorization mixins.",
  "backend/migration.mo": "Migration converting single admin password into a username‑keyed credential map while preserving session data.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests supporting the updated admin login feature.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components, pages, editors, and hooks.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and global base styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Router setup defining public and admin routes, redirects, and overall theme/layout providers.",
  "frontend/src/components/admin/PublishToggle.tsx": "Button component to publish or unpublish articles with loading states and error‑aware toasts.",
  "frontend/src/components/auth/AdminLoginForm.tsx": "Admin login form collecting username/password and submitting through the session hook with error display.",
  "frontend/src/components/auth/LoginButton.tsx": "Empty file.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Empty file.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guard rendering admin content only when authenticated, otherwise showing the login form.",
  "frontend/src/components/content/ContentBodyRenderer.tsx": "Renderer converting simple markdown‑style syntax to HTML and inserting it into a styled container.",
  "frontend/src/components/content/ContentCard.tsx": "Displays an article preview card with cover image, title, excerpt, and formatted date, linking to the article page.",
  "frontend/src/components/editor/BodyEditor.tsx": "Markdown-enabled textarea editor with an optional image upload panel that inserts uploaded images as markdown.",
  "frontend/src/components/editor/ImageUploadPanel.tsx": "Handles image file validation, uploads via ExternalBlob with progress tracking, and shows a preview with removal controls.",
  "frontend/src/components/layout/SiteLayout.tsx": "Provides the main site layout with header navigation, authentication-aware admin actions, content container, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminContent.ts": "React Query hooks for admin operations like fetching, creating, updating, publishing, and unpublishing articles.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin login sessions with token storage, expiration handling, and login/logout helpers tied to the actor.",
  "frontend/src/hooks/useContentPublic.ts": "React Query hooks for fetching publicly available published articles and article details.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity loading. Wraps AuthClient creation and exposes status flags.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes. Adds utility styles such as global border and image styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard listing all articles with status, edit buttons, and publish toggles, wrapped in admin access control.",
  "frontend/src/pages/admin/ContentEditorPage.tsx": "Article creation/editing form with title, body, image upload, and save handling including error and loading states.",
  "frontend/src/pages/ArticlesListPage.tsx": "Fetches and displays a list of published articles with loading skeletons and fallback UI when empty.",
  "frontend/src/pages/ContentDetailPage.tsx": "Shows full article details with cover image, metadata, body rendering, and admin edit access; handles loading and not-found states.",
  "frontend/src/pages/HomePage.tsx": "Displays a hero banner and a call-to-action linking to the articles section.",
  "frontend/src/pages/NotesListPage.tsx": "Empty page placeholder for notes listing.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, storing them in sessionStorage, and syncing persisted values, including hash-based param handling and cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, typography, animations, and plugin setup.",
  "project_state.json": "JSON snapshot describing project state, existing and new feature requests, and admin credential upgrade requirements."
}