{
  "backend/main.mo": "Motoko canister implementing user profiles and admin‑gated article CRUD with publish control, using AccessControl and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-style list providing human-written summaries for each frontend file in the project.",
  "frontend/index.css": "Tailwind CSS base/theme variables defining light/dark color tokens and global styling.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup defining public and admin routes with redirects and layout/theme providers.",
  "frontend/src/components/admin/PublishToggle.tsx": "UI control for publishing or unpublishing articles with loading states, error handling, and owner-only restrictions.",
  "frontend/src/components/auth/LoginButton.tsx": "Empty placeholder file for login button component.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Empty placeholder file for profile setup modal component.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Admin-only guard that checks identity and admin status and shows an owner-access-only alert when unauthorized.",
  "frontend/src/components/content/ContentBodyRenderer.tsx": "Markdown-like parser that converts headers, images, bold/italic, and paragraphs into styled HTML.",
  "frontend/src/components/content/ContentCard.tsx": "Article preview card showing cover image, title, excerpt, and date, linking to the article detail page.",
  "frontend/src/components/editor/BodyEditor.tsx": "Markdown text editor with image upload toggle and textarea input.",
  "frontend/src/components/editor/ImageUploadPanel.tsx": "Image upload component handling validation, preview, progress, and callbacks.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main site layout with header navigation, admin link, content slot, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instance tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdminContent.ts": "Admin-focused hooks for checking admin status and managing articles and user profiles through the actor.",
  "frontend/src/hooks/useContentPublic.ts": "Public content hooks for fetching published articles and individual article data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication state and login flow.",
  "frontend/src/index.css": "Tailwind CSS base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, identity provider, and global styles.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing article list with edit and publish controls.",
  "frontend/src/pages/admin/ContentEditorPage.tsx": "Form for creating or editing an article, including title, body, and cover image handling.",
  "frontend/src/pages/ArticlesListPage.tsx": "Page listing published articles with loading skeletons and empty-state handling.",
  "frontend/src/pages/ContentDetailPage.tsx": "Displays a single article with metadata, cover image, and edit options for admins.",
  "frontend/src/pages/HomePage.tsx": "Renders a hero banner and link to browse articles.",
  "frontend/src/pages/NotesListPage.tsx": "Empty page placeholder for listing notes.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, colors, fonts, and plugins.",
  "project_state.json": "Defines current project scope: an article‑only website with owner‑only editing, image support, draft/publish workflow, and removal of all Notes features."
}