{
  "backend/main.mo": "Motoko canister implementing user profiles, admin-restricted article CRUD, publishing, and blob storage with AccessControl checks.",
  "feature_evidence.json": "Feature evidence report linking admin access-flow update to affected frontend auth components and related packages.",
  "frontend-file-summaries.txt": "Prewritten summaries for major frontend components including pages, layout, auth, editor, and content UI modules.",
  "frontend/index.css": "Tailwind base and design tokens defining light/dark theme CSS variables and global styles.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for public pages and admin pages with old notes redirects wrapped in ThemeProvider and SiteLayout.",
  "frontend/src/components/admin/PublishToggle.tsx": "Button component to publish or unpublish articles with API mutations, loading states, and authorization-aware error handling.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity sign‑in/out button with loading handling, query cache reset, and retry logic for already-authenticated errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Empty file placeholder for a profile setup modal component.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Admin guard that shows sign‑in prompt, restricted-access message, or protected children based on Internet Identity and admin status.",
  "frontend/src/components/content/ContentBodyRenderer.tsx": "Markdown-like renderer converting basic formatting to HTML and injecting it into a styled content container.",
  "frontend/src/components/content/ContentCard.tsx": "Renders an article preview card with title, excerpt, date, and optional cover image linking to the article page.",
  "frontend/src/components/editor/BodyEditor.tsx": "Markdown text editor with image insertion support and optional image upload panel.",
  "frontend/src/components/editor/ImageUploadPanel.tsx": "Handles image file selection, validation, upload via ExternalBlob, preview display, and removal.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header navigation, admin visibility checks, content area, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminContent.ts": "Provides admin-focused queries and mutations for user profiles and full article management using the backend actor.",
  "frontend/src/hooks/useContentPublic.ts": "Public-facing hooks to fetch published articles and individual article details via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login/logout handling, and persistence of identities using AuthClient.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode overrides, and utility styles.",
  "frontend/src/main.tsx": "Bootstraps the app with React, query client provider, and Internet Identity provider.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard for managing articles, including creation, editing, status display, and publishing.",
  "frontend/src/pages/admin/ContentEditorPage.tsx": "Admin page for creating or editing an article with title, body, and optional cover image handling.",
  "frontend/src/pages/ArticlesListPage.tsx": "Displays a list of published articles with loading skeletons and a fallback when none exist.",
  "frontend/src/pages/ContentDetailPage.tsx": "Shows a single article’s details with admin edit controls, loading states, and formatted metadata.",
  "frontend/src/pages/HomePage.tsx": "Renders a hero section and link card directing users to browse articles.",
  "frontend/src/pages/NotesListPage.tsx": "Empty placeholder page for future notes listing.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, and plugins.",
  "project_state.json": "Defines the project’s current scope and architecture, focusing on an articles-only website with owner‑only admin access and image support. Lists existing features, scope changes, and versioned project state metadata."
}