{
  "kind": "build_request",
  "title": "Remove public login UI and restrict publishing to the site owner only",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Remove all public-facing login/logout and profile-setup UX from the site layout so visitors cannot see or use any authentication controls (no login button, no logout button, no profile setup modal).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove login feature and only i will publish it's artical and image"
        ]
      },
      "acceptanceCriteria": [
        "The header navigation in SiteLayout no longer renders the LoginButton component.",
        "ProfileSetupModal is not rendered on public pages (or at all).",
        "No user-facing page shows buttons/links labeled \"Login\" or \"Logout\" to general visitors."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Keep the admin/editor pages protected so that only the site owner can access create/edit/publish/unpublish actions; non-owners must not be able to publish articles or upload images even if they discover admin routes.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove login feature and not anyone can publish articals",
          "remove login feature and only i will publish it's artical and image"
        ]
      },
      "acceptanceCriteria": [
        "All backend content-mutation methods (createArticle, updateArticle, publishArticle, unpublishArticle) continue to reject non-owner callers with an unauthorized error.",
        "Admin UI routes (/admin, /admin/articles/new, /admin/articles/:id/edit) remain inaccessible to non-owners (they see an access denied / authentication required experience and cannot reach editing controls).",
        "Image upload functionality used by the editor cannot successfully upload/store images for non-owner callers."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Adjust admin gating UI text to reflect owner-only access and remove any implication that the site supports general user accounts (use English text).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove login feature and only i will publish it's artical and image"
        ]
      },
      "acceptanceCriteria": [
        "Admin guard screens/messages refer to \"Owner access\" or \"Admin access\" and do not instruct general visitors to create a profile.",
        "All user-facing authentication/access-denied strings shown by admin gating components are in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only shadcn components).",
    "Do not edit immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo changes if a stable-state upgrade is required."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is available).",
    "Adding multi-user roles, invitations, or a public registration system.",
    "Changing the public content model beyond the login/publishing restrictions (Articles-only remains as-is)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}