{
  "kind": "build_request",
  "title": "Add owner bootstrap flow (no username/password) for admin access to /admin",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Implement a one-time backend “owner bootstrap” mechanism that allows the first authenticated Internet Identity principal to claim admin/owner access when no admin has been set yet, and prevents further claims once an admin exists.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "creat admin user id and password and give it to me"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a canister method to check whether any admin/owner exists (e.g., returns boolean).",
        "Backend exposes a canister method to claim/initialize admin/owner access for the current caller, which succeeds only when no admin exists yet.",
        "If an admin/owner already exists, the claim/initialize method fails (traps) and does not change admin state.",
        "After a successful claim, the caller is recognized as admin by existing admin checks (e.g., `isCallerAdmin()` returns true for that caller)."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Update the /admin access flow in the frontend so that a site owner can sign in with Internet Identity and (if needed) claim owner/admin access, without introducing any public username/password UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "creat admin user id and password and give it to me"
        ]
      },
      "acceptanceCriteria": [
        "When visiting /admin while not signed in, the page shows an owner-only access screen with a clear call-to-action to “Sign in with Internet Identity” (use the existing Internet Identity hook login flow).",
        "When signed in but not an admin: if the backend indicates no admin exists yet, the UI shows a “Claim Owner Access” action that calls the backend bootstrap method; on success, the admin dashboard becomes accessible without a page reload.",
        "When signed in but not an admin and an admin already exists, the UI clearly states that the area is restricted to the site owner and provides no way to bypass it.",
        "All user-facing text related to this flow is in English and does not mention general user accounts.",
        "No login/logout controls are added to public (non-admin) site layout/navigation beyond what already exists."
      ]
    }
  ],
  "constraints": [
    "Do not implement username/password authentication; admin access must remain based on Internet Identity principals only.",
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or other immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Providing an actual admin username and password to the user.",
    "Adding third-party authentication providers (Google, GitHub, Auth0, etc.).",
    "Building multi-user account management features beyond owner/admin bootstrapping."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}