{
  "kind": "build_request",
  "title": "Reset admin login credentials to provided username/password",
  "projectName": "My Collection",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend admin credential model to store and verify a single admin username + password pair (not password-only), and update the login API to require both username and password.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "admin username: adminankit • admin password: ankits-0812"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes an admin login method that requires both username and password and returns a session token on success.",
        "Login attempts with an incorrect username or password fail with an unauthorized error (and do not create a session).",
        "Existing admin-gated APIs continue to accept the existing session token parameter for authorization as they do now."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a backend admin-credential reset using the user-provided values: set admin username to \"adminankit\" and admin password to \"ankits-0812\" via the existing credential initialization/update mechanism, ensuring updates require a valid admin session when credentials already exist.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "admin username: adminankit • admin password: ankits-0812"
        ]
      },
      "acceptanceCriteria": [
        "After deployment, the admin can log in successfully using username \"adminankit\" and password \"ankits-0812\".",
        "If credentials were already set previously, the backend rejects credential updates unless the caller is authorized via an existing valid admin session token (or other existing admin authorization path)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Persist admin credentials across canister upgrades by storing them in stable state and adding a conditional migration to preserve any existing password-only credential data (if present) by mapping it into the new username+password credential structure.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "admin username: adminankit • admin password: ankits-0812"
        ]
      },
      "acceptanceCriteria": [
        "Admin credentials remain intact after a canister upgrade.",
        "If the canister previously stored only a password credential, the migration preserves it (e.g., by placing it into the new structure) rather than losing it during upgrade.",
        "No migration is performed/required when deploying to a fresh canister with no prior state."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the frontend admin login UI and session hook to accept a username and password, and call the updated backend login API accordingly. All user-facing text must be in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "admin username: adminankit • admin password: ankits-0812"
        ]
      },
      "acceptanceCriteria": [
        "Admin login form includes both a Username and Password field and submits both values.",
        "On invalid credentials, the UI shows an English error message indicating invalid credentials.",
        "On successful login, the session token is stored as it is today and admin pages become accessible."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko architecture with logic in backend/main.mo; add backend/migration.mo only as needed for upgrade state changes per the conditional migration policy.",
    "Do not edit frontend files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers (only existing auth mechanisms are in scope).",
    "Do not add new admin roles or multiple admin accounts; keep a single admin credential pair.",
    "Do not introduce external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}